/*
问题描述
	小明为某机构设计了一个十字型的徽标（并非红十字会啊），如下所示：

..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$..
	对方同时也需要在电脑dos窗口中以字符的形式输出该标志，并能任意控制层数。

输入格式
	一个正整数 n (n<30) 表示要求打印图形的层数。
输出格式
	对应包围层数的该标志。
样例输入1
	1
样例输出1
..$$$$$..
..$...$..
$$$.$.$$$
$...$...$
$.$$$$$.$
$...$...$
$$$.$.$$$
..$...$..
..$$$$$..


样例输入2
	3
样例输出2
..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$..
提示
	请仔细观察样例，尤其要注意句点的数量和输出位置。
*/
#include <iostream>

int go(int i, int j, int n)
{
	//先将图形变成只是左上角部分的图形
	if (i > n * 2 + 3)
		i = n * 4 + 6 - i;
	if (j > n * 2 + 3)
		j = n * 4 + 6 - j;

	//先打印左上角四个 '.'
	if (i <= 2 && j <= 2)
		return 0;

	//奇数行,并且只打印奇数行横着的
	if (i % 2 == 1 && j >= i + 2)
		return 1;
	//奇数列，并且只打印奇数列竖着的
	if (j % 2 == 1 && i >= j + 2)
		return 1;

	// B区域
	if (i == j && i % 2 == 1)
		return 1;
	if (i % 2 == 0 && j - i == 1)
		return 1;
	if (j % 2 == 0 && i - j == 1)
		return 1;

	return 0;

}




int main(void)
{
	//输入n，那么这个图形的长宽都等于n * 4 + 5 ，多申请一个是因为不用0下标
	char map[30 * 4 + 6][30 * 4 + 6] = { 0 };
	int i = 0;
	int j = 0;
	int n = 0;

	std::cin >> n;
	for (i = 1; i <= n * 4 + 5; i++)
	{
		for (j = 1; j <= n * 4 + 5; j++)
		{
			if (go(i, j, n) == 1)
				std::cout << '$';
			else
				std::cout << '.';
		}
		std::cout << std::endl;
	}

	return 0;
}