#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <Windows.h>

//问题描述
//对于长度为5位的一个01串，每一位都可能是0或1，一共有32种可能。它们的前几个是：
//00000
//00001
//00010
//00011
//00100
//请按从小到大的顺序输出这32种01串。
//
//输入格式
//本试题没有输入。
//输出格式
//输出32行，按从小到大的顺序每行一个长度为5的01串。
//样例输出
//00000
//00001
//00010
//00011
//<以下部分省略>


int main(void)
{
	char Bin[32][6] = { "00000", "00001", "00010", "00011", "00100", "00101", "00110", "00111", \
		"01000", "01001", "01010", "01011", "01100", "01101", "01110", "01111", \
		"10000", "10001", "10010", "10011", "10100", "10101", "10110", "10111", \
		"11000", "11001", "11010", "11011", "11100", "11101", "11110", "11111", };
	int i = 0;

	for (i = 0; i < 32; i++)
	{
		printf("%s\n", Bin[i]);
	}

	system("pause");
	return 0;
}